In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [7]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data=my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [13]:
#### you can pass a buit in function to pandas to store it
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [14]:
series1=pd.Series([1,2,3,4],['USA','GERMANY','USSR','JAPAN'])

In [15]:
series1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [16]:
series2=pd.Series([1,2,5,4],['USA','GERMANY','ITALY','JAPAN'])

In [17]:
series2

USA        1
GERMANY    2
ITALY      5
JAPAN      4
dtype: int64

In [18]:
series1['USA']

1

In [19]:
series3=pd.Series(data=labels)

In [20]:
series3

0    a
1    b
2    c
dtype: object

In [24]:
series3[0]

'a'

### note pandas and numpy will always convert stuff to float (keep it in mind)

In [23]:
series1+series2
# if it didnt find matches it will return null value for those
# when you performing operations with pandas serries your integer are going to be converted to floats

GERMANY    4.0
ITALY      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

## dataframe

In [25]:
import numpy as np

In [26]:
import pandas as pd

In [27]:
from numpy.random import randn

In [28]:
np.random.seed(101)

In [32]:
df=pd.DataFrame(randn(4,4),['A','B','C','D'],['W','X','Y','Z'])

In [33]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765

In [34]:
df['W']

A    0.681209
B   -1.005187
C   -1.382920
D    0.992573
Name: W, dtype: float64

In [35]:
type(df['W'])

pandas.core.series.Series

In [36]:
type(df)

pandas.core.frame.DataFrame

In [39]:
df[['W','Z']]

          W         Z
A  0.681209  1.939932
B -1.005187 -0.732845
C -1.382920 -2.141212
D  0.992573  1.292765

### CREATE NEW COLUMN

In [70]:
df['new']= df['W']+df['Y']

In [71]:
df

          W         X         Y         Z       new
A  0.681209  1.035125 -0.031160  1.939932  0.650049
B -1.005187 -0.741790  0.187125 -0.732845 -0.818062
C -1.382920  1.482495  0.961458 -2.141212 -0.421462
D  0.992573  1.192241 -1.046780  1.292765 -0.054206

#### remove a column

In [67]:
### axis=1 refers to columns and axis =0 refers to index
### inplace = true it will drop the columns from the original dataframe not just remove from a view of it

In [72]:
df.drop(['new'],axis=1,inplace=True)

In [73]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765

In [74]:
df.drop('A',inplace=True)

In [75]:
df

          W         X         Y         Z
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765

In [76]:
df.shape

(3, 4)

In [78]:
### SELECT ROWS

In [79]:
df

          W         X         Y         Z
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765

In [83]:
df.loc['B']

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: B, dtype: float64

In [84]:
### iloc returns the rows with the help of index no matter the exact index is string or other data types

In [85]:
df.iloc[0]

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: B, dtype: float64

In [86]:
df.loc['B','Y']

0.1871245217641948

In [87]:
df.loc[['B','C'],['X','Z']]

          X         Z
B -0.741790 -0.732845
C  1.482495 -2.141212

#### Conditional selection

In [88]:
import numpy as np
import pandas as pd

In [89]:
from numpy.random import randn

In [90]:
np.random.seed(101)

In [91]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [93]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [94]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [95]:
 booldf= df>0

In [98]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [99]:
### the line below cause the return of value whrn the cell is true and nan when the cell is false

In [100]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [101]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [103]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [105]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [106]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [107]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [108]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [110]:
boolser=df['W']>0

In [111]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [112]:
result = df[boolser]

In [113]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [116]:
result[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [117]:
### multiple condition

In [118]:
### do not do the following for multiple condition

In [120]:
# df[(df['W']>0) and (df['Y']>1)]

In [124]:
# use & instead of and 
# use | instead of or
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [125]:
### reset indexes of data frame back to default

In [126]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [127]:
# it does not happen inplace we have to say it specificly
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [128]:
df.reset_index(inplace=True)

In [129]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [130]:
newind='CA NY WY OR CO'.split()

In [131]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [132]:
df['state']=newind

In [133]:
df

  index         W         X         Y         Z state
0     A  2.706850  0.628133  0.907969  0.503826    CA
1     B  0.651118 -0.319318 -0.848077  0.605965    NY
2     C -2.018168  0.740122  0.528813 -0.589001    WY
3     D  0.188695 -0.758872 -0.933237  0.955057    OR
4     E  0.190794  1.978757  2.605967  0.683509    CO

In [137]:
## if you have a column that you want it to be a index
df.set_index('state',inplace=True)

In [138]:
df

      index         W         X         Y         Z
state
CA        A  2.706850  0.628133  0.907969  0.503826
NY        B  0.651118 -0.319318 -0.848077  0.605965
WY        C -2.018168  0.740122  0.528813 -0.589001
OR        D  0.188695 -0.758872 -0.933237  0.955057
CO        E  0.190794  1.978757  2.605967  0.683509

### multi index and index hirarcy

In [139]:
import numpy as np

In [140]:
import pandas as pd

In [147]:
#### create a mulilevel index
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [149]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [151]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [154]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [156]:
# name the indexs columns
df.index.names=['Groups','Num']

In [157]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [158]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [162]:
# cross section function it has the ability to skip or go inside the multilevel index
df.xs('G1')
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

### missing data in pandas

In [163]:
import numpy as np
import pandas as pd

In [165]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [167]:
df=pd.DataFrame(d)

In [168]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [172]:
# pandas will remove any row with any single nab=n value
df.dropna()
# drop any column that contain nan value
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [174]:
# just removes the lines that contains at least 2 nan value
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### fill nan values

In [175]:
df.fillna(value="mobina")

        A       B  C
0     1.0     5.0  1
1     2.0  mobina  2
2  mobina  mobina  3

In [176]:
## usually we fill the nan value by the mean of that column

In [180]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Group BY

In [181]:
data ={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
          'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
      'Sales':[200,120,340,124,243,350]}

In [182]:
df = pd.DataFrame(data)

In [183]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [185]:
byComp =df.groupby('Company')

In [186]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [187]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [188]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [190]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [191]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [192]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [193]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [195]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0